app/controllers/movies_controller.rb

  def index
    @ratingsHash = Hash.new()
    @all_ratings = Movie.all_ratings
    if params[:ratings].nil?
      @ratings = @all_ratings
    else
      @ratings = params[:ratings].keys
    end
    @all_ratings.each { |x| @ratingsHash[x]=1 }
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date